ychong0711-ops/stm32-learning/01_learning_program/server/commented_build/main_build.c
// 
// FreeRTOS 임베디드 애플리케이션 예제 (수정판)
// --------------------------------------------------------------------------
// [수정 1] 워치독(Watchdog) 단일 실패점 제거
// - 기존: IWDG 피드를 CAN 수신 태스크만 담당 → 펌웨어 업데이트 시 CAN 태스크가
// 정지되면 플래싱 도중 워치독 타임아웃으로 시스템이 리셋되어 펌웨어가
// 손상(벽돌)될 위험이 있었음.
// - 수정: 전용 워치독 태스크(vTask_Watchdog)를 두고, 각 태스크의 하트비트를
// 모두 확인한 뒤에만 IWDG를 피드. 펌웨어 업데이트 중에는 업데이트 플래그로
// 무조건 피드로 전환하고, 플래시 기록 함수 내부에서도 IWDG를 피드.
// 
// [수정 2] 긴급 정지(Emergency Stop) 경로 보장
// - 기존: 긴급 정지가 "큐 전송 → 뮤텍스(5ms 타임아웃) → 액추에이터 태스크" 체인을
// 거치며, 큐 가득 참/뮤텍스 실패 시 조용히 유실될 수 있었음.
// - 수정: 긴급 정지는 CAN 수신 태스크에서 큐를 거치지 않고 즉시 안전 상태를
// 적용(prvEmergencyStop). 뮤텍스는 portMAX_DELAY로 획득을 보장.
// --------------------------------------------------------------------------
// BSP 함수들(CAN_Receive, ADC_ReadChannel, PWM_SetDuty 등)은 실제 드라이버 함수가
// 존재한다고 가정한 코드입니다.
// 

#include "stm32f4xx_hal.h" // HAL_Init() 등 HAL 공통 API를 사용하기 위해 포함합니다. (통합 계층 보강)
#include "FreeRTOS.h" // FreeRTOS 커널 API와 자료형을 사용하기 위해 포함합니다.
#include "task.h" // 태스크 생성, 삭제, 지연, 스케줄링 API를 사용하기 위해 포함합니다.
#include "queue.h" // 태스크 간 데이터 전달을 위한 큐 API를 사용하기 위해 포함합니다.
#include "semphr.h" // 세마포어와 뮤텍스 API를 사용하기 위해 포함합니다.
#include <stdint.h> // uint8_t, uint16_t, uint32_t, int32_t 등 고정 폭 정수 타입을 사용하기 위해 포함합니다.
#include <stdio.h> // printf 기반 UART 디버깅 출력을 사용하기 위해 포함합니다. (구현은 app/tiny_printf.c)
#include "bsp_can.h" // CAN 초기화 및 수신 함수가 선언되어 있다고 가정하고 포함합니다.
#include "bsp_adc.h" // ADC 초기화 및 채널 읽기 함수가 선언되어 있다고 가정하고 포함합니다.
#include "bsp_pwm.h" // PWM 초기화 및 듀티 설정 함수가 선언되어 있다고 가정하고 포함합니다.
#include "bsp_gpio.h" // GPIO 초기화 및 출력 제어 함수가 선언되어 있다고 가정하고 포함합니다.
#include "bsp_uart.h" // UART 초기화 함수가 선언되어 있다고 가정하고 포함합니다.
#include "bsp_iwdg.h" // 독립 워치독 피드 함수가 선언되어 있다고 가정하고 포함합니다.
#include "bsp_flash.h" // 내부/외부 플래시 제어 함수가 선언되어 있다고 가정하고 포함합니다.
#include "bootloader.h" // 부트로더 업데이트 요청 확인 및 플래싱 함수가 선언되어 있다고 가정하고 포함합니다.
#include "sensor_bmp280.h" // BMP280 온도/압력 센서 함수가 선언되어 있다고 가정하고 포함합니다.
#include "system_stm32.h" // 시스템 클록 설정 및 NVIC 시스템 리셋 함수가 선언되어 있다고 가정하고 포함합니다.

#define TASK_WATCHDOG_STACK_SIZE 128U // 워치독 태스크의 스택 크기를 워드 단위로 정의합니다.
#define TASK_CAN_STACK_SIZE 256U // CAN 수신 태스크의 스택 크기를 워드 단위로 정의합니다.
#define TASK_SENSOR_STACK_SIZE 128U // 센서 수집 태스크의 스택 크기를 워드 단위로 정의합니다.
#define TASK_ACTUATOR_STACK_SIZE 128U // 액추에이터 제어 태스크의 스택 크기를 워드 단위로 정의합니다.
#define TASK_DEBUG_STACK_SIZE 256U // 디버깅 태스크의 스택 크기를 워드 단위로 정의합니다.
#define TASK_FIRMWARE_STACK_SIZE 512U // 펌웨어 업데이트 태스크의 스택 크기를 워드 단위로 정의합니다.

#define TASK_WATCHDOG_PRIORITY 6U // 워치독 태스크는 최상위 우선순위로 두어 항상 실행되도록 합니다.
#define TASK_CAN_PRIORITY 5U // CAN 수신 태스크는 두 번째로 높은 우선순위로 설정합니다.
#define TASK_SENSOR_PRIORITY 3U // 센서 태스크는 중간 우선순위로 설정합니다.
#define TASK_ACTUATOR_PRIORITY 3U // 액추에이터 태스크는 중간 우선순위로 설정합니다.
#define TASK_DEBUG_PRIORITY 2U // 디버깅 태스크는 낮은 우선순위로 설정합니다.
#define TASK_FIRMWARE_PRIORITY 1U // 펌웨어 업데이트 태스크는 가장 낮은 우선순위로 설정합니다.

#define ACTUATOR_CMD_QUEUE_LEN 16U // 액추에이터 명령 큐의 최대 깊이를 정의합니다.
#define SENSOR_DATA_QUEUE_LEN 16U // 센서 데이터 큐의 최대 깊이를 정의합니다.

#define WATCHDOG_CHECK_PERIOD_MS 100U // 워치독 태스크의 하트비트 검사 주기를 100ms로 정의합니다.
#define CAN_RX_TIMEOUT_MS 10U // CAN 수신 타임아웃을 10ms로 정의합니다.
#define ACTUATOR_QUEUE_TIMEOUT_MS 20U // 액추에이터 명령 큐 대기 타임아웃을 20ms로 정의합니다.
#define ACTUATOR_MUTEX_TIMEOUT_MS 5U // 액추에이터 뮤텍스 획득 타임아웃을 5ms로 정의합니다.
#define DEBUG_QUEUE_TIMEOUT_MS 100U // 디버깅 태스크의 센서 큐 대기 타임아웃을 100ms로 정의합니다.
#define DEBUG_MUTEX_TIMEOUT_MS 50U // 디버깅 뮤텍스 획득 타임아웃을 50ms로 정의합니다.
#define FIRMWARE_CHECK_PERIOD_MS 5000U // 펌웨어 업데이트 요청 확인 주기를 5초로 정의합니다.

#define CAN_ID_EMERGENCY 0x123U // 긴급 정지 메시지로 사용할 CAN ID를 정의합니다.
#define CAN_ID_THROTTLE_CMD 0x200U // 스로틀 제어 명령으로 사용할 CAN ID를 정의합니다.
#define CAN_ID_FAN_CMD 0x201U // 팬 제어 명령으로 사용할 CAN ID를 정의합니다.

#define ADC_CHANNEL_RPM 0U // RPM 센서를 읽는 ADC 채널 번호를 정의합니다.
#define ADC_CHANNEL_THROTTLE 1U // 스로틀 센서를 읽는 ADC 채널 번호를 정의합니다.
#define PWM_CHANNEL_THROTTLE 0U // 스로틀 제어에 사용할 PWM 채널을 정의합니다.
#define GPIO_PIN_FAN 13U // 팬 제어에 사용할 GPIO 핀 번호를 정의합니다.

#define UART_BAUD_115200 115200U // UART 통신 속도를 115200bps로 정의합니다.
#define CAN_SPEED_500KBPS 500000U // CAN 통신 속도를 500kbps로 정의합니다.

// IWDG 리로드 값(타임아웃)은 워치독 검사 주기(100ms)보다 충분히 크게 설정해야 합니다.
// 예: IWDG 프리스케일러/리로드를 조합하여 약 1초로 설정하는 것을 권장합니다. 

// [통합 시 삭제됨] CAN_Message_t 는 bsp_can.h 가 정의합니다.
// 원래 이 자리에는 동일한 내용의 typedef 가 중복되어 있었습니다. 익명 구조체
// typedef 는 두 번 쓰면 "서로 다른 타입"이 되어 C11 에서도 재정의 오류가 나므로,
// 실제 빌드에서는 BSP 헤더의 정의 하나만 남겨야 합니다.
// (참고: 필드 구성은 { uint32_t ID; uint8_t DLC; uint8_t data[8]; } 로 동일합니다) 

typedef struct // 센서 데이터 구조체 정의를 시작합니다.
{ // 센서 데이터 멤버 변수 선언을 시작합니다.
    uint16_t rpm; // RPM 센서 측정값을 저장합니다.
    float temperature; // 온도 센서 측정값을 저장합니다.
    uint16_t throttle; // 스로틀 위치 센서 측정값을 저장합니다.
    TickType_t timestamp; // 센서 데이터를 읽은 시점의 FreeRTOS 틱을 저장합니다.
} SensorData_t; // 센서 데이터 구조체 타입 이름을 SensorData_t로 정의합니다.

typedef enum // 액추에이터 명령 ID 열거형 정의를 시작합니다.
{ // 액추에이터 명령 ID 값 선언을 시작합니다.
    CMD_NONE = 0, // 유효하지 않은 명령 또는 명령 없음을 의미합니다.
    CMD_THROTTLE, // 스로틀 PWM 제어 명령을 의미합니다.
    CMD_FAN, // 팬 GPIO 제어 명령을 의미합니다.
    CMD_EMERGENCY_STOP // 긴급 정지 명령을 의미합니다.
} ActuatorCommandId_t; // 액추에이터 명령 ID 타입 이름을 ActuatorCommandId_t로 정의합니다.

typedef struct // 액추에이터 명령 구조체 정의를 시작합니다.
{ // 액추에이터 명령 멤버 변수 선언을 시작합니다.
    ActuatorCommandId_t commandId; // 실행할 액추에이터 명령 종류를 저장합니다.
    uint16_t duty; // PWM 듀티 또는 제어량을 저장합니다.
    uint8_t state; // GPIO 온/오프 상태를 저장합니다.
    uint32_t sourceCanId; // 명령을 발생시킨 CAN ID를 저장합니다.
} ActuatorCmd_t; // 액추에이터 명령 구조체 타입 이름을 ActuatorCmd_t로 정의합니다.

// [통합 시 삭제됨] FirmwareState_t 는 bootloader.h 가 정의합니다.
// 값 구성(UPDATE_NONE=0, UPDATE_AVAILABLE)은 동일합니다. 다만 의미가 정밀해졌습니다.
// 스테이징 패턴에서 UPDATE_AVAILABLE 은 "업데이트 요청이 있다"가 아니라
// "검증을 통과한 스테이징 이미지가 있어 설치할 수 있다" 를 뜻합니다. 

static TaskHandle_t xTaskHandle_Watchdog = NULL; // 워치독 태스크의 핸들을 저장합니다.
static TaskHandle_t xTaskHandle_CAN_Rx = NULL; // CAN 수신 태스크의 핸들을 저장합니다.
static TaskHandle_t xTaskHandle_Sensor = NULL; // 센서 수집 태스크의 핸들을 저장합니다.
static TaskHandle_t xTaskHandle_Actuator = NULL; // 액추에이터 제어 태스크의 핸들을 저장합니다.
static TaskHandle_t xTaskHandle_Debug = NULL; // 디버깅 태스크의 핸들을 저장합니다.
static TaskHandle_t xTaskHandle_Firmware = NULL; // 펌웨어 업데이트 태스크의 핸들을 저장합니다.

static QueueHandle_t xQueue_ActuatorCmd = NULL; // 액추에이터 명령을 전달하는 큐 핸들입니다.
static QueueHandle_t xQueue_Sensor_Data = NULL; // 센서 데이터를 전달하는 큐 핸들입니다.

static SemaphoreHandle_t xSemaphore_Actuator = NULL; // 액추에이터 자원 보호용 뮤텍스입니다.
static SemaphoreHandle_t xMutex_Debug = NULL; // UART/printf 동시 접근 방지용 뮤텍스입니다.

