ychong0711-ops/stm32-learning/01_learning_program/server/commented_build/main_build.c
void vTask_Sensor(void *pvParameters) // 센서 수집 태스크 함수를 정의합니다.
{ // 센서 수집 태스크 함수 본문을 시작합니다.
    (void)pvParameters; // 사용하지 않는 태스크 파라미터로 인한 경고를 방지합니다.
    SensorData_t xSensorData; // 한 주기 동안 읽은 센서 데이터를 저장할 변수입니다.
    const TickType_t xPeriod = pdMS_TO_TICKS(10U); // 센서 읽기 주기 10ms를 틱 단위로 변환하여 저장합니다.
    TickType_t xLastWakeTime = xTaskGetTickCount(); // 주기 지연을 위해 현재 틱 값으로 마지막 깨어남 시각을 초기화합니다.

    ADC_Init(); // ADC 주변장치를 초기화합니다.
    BMP280_Init(); // BMP280 온도/압력 센서를 초기화합니다.

    for (;;) // 센서 수집 태스크의 무한 루프를 시작합니다.
    { // 센서 수집 태스크 루프 본문을 시작합니다.
        ulHeartbeat_Sensor++; // 워치독이 이 태스크의 생존을 확인하도록 하트비트를 증가시킵니다.

        xSensorData.rpm = ADC_ReadChannel(ADC_CHANNEL_RPM); // RPM 센서 값을 ADC로 읽습니다.
        xSensorData.temperature = BMP280_ReadTemperature(); // 온도 센서 값을 BMP280에서 읽습니다.
        xSensorData.throttle = ADC_ReadChannel(ADC_CHANNEL_THROTTLE); // 스로틀 센서 값을 ADC로 읽습니다.
        xSensorData.timestamp = xTaskGetTickCount(); // 센서 읽기 시점의 타임스탬프를 저장합니다.

        if (xQueueSend(xQueue_Sensor_Data, &xSensorData, 0U) != pdPASS) // 센서 데이터 큐에 데이터 전송을 시도하고 실패 여부를 확인합니다.
        { // 센서 데이터 큐 전송 실패 처리 블록을 시작합니다.
            ulErrCount_SensorQueueFull++; // 큐 가득 참으로 센서 데이터가 유실된 횟수를 기록합니다.
        } // 센서 데이터 큐 전송 실패 처리 블록을 종료합니다.

        vTaskDelayUntil(&xLastWakeTime, xPeriod); // 다음 10ms 주기까지 태스크를 지연시켜 정밀한 주기를 유지합니다.
    } // 센서 수집 태스크 무한 루프를 종료합니다.
} // 센서 수집 태스크 함수를 종료합니다.

void vTask_Actuator(void *pvParameters) // 액추에이터 제어 태스크 함수를 정의합니다.
{ // 액추에이터 제어 태스크 함수 본문을 시작합니다.
    (void)pvParameters; // 사용하지 않는 태스크 파라미터로 인한 경고를 방지합니다.
    ActuatorCmd_t xCmd; // 큐에서 수신한 액추에이터 명령을 저장할 변수입니다.
    BaseType_t xStatus; // 명령 큐 수신 성공 여부를 저장할 변수입니다.
    const TickType_t xQueueTimeout = pdMS_TO_TICKS(ACTUATOR_QUEUE_TIMEOUT_MS); // 명령 큐 대기 타임아웃을 20ms로 설정합니다.

    PWM_Init(PWM_CHANNEL_THROTTLE, 20000U); // 스로틀 PWM 채널을 20kHz로 초기화합니다.
    GPIO_Init(GPIO_PIN_FAN); // 팬 제어용 GPIO 핀을 초기화합니다.
    PWM_SetDuty(PWM_CHANNEL_THROTTLE, 0U); // 초기 상태에서 스로틀 PWM 듀티를 0으로 설정합니다.
    GPIO_Write(GPIO_PIN_FAN, 0U); // 초기 상태에서 팬 GPIO를 OFF로 설정합니다.

    for (;;) // 액추에이터 제어 태스크의 무한 루프를 시작합니다.
    { // 액추에이터 제어 태스크 루프 본문을 시작합니다.
        ulHeartbeat_Actuator++; // 워치독이 이 태스크의 생존을 확인하도록 하트비트를 증가시킵니다.

        xStatus = xQueueReceive(xQueue_ActuatorCmd, &xCmd, xQueueTimeout); // 액추에이터 명령 큐에서 명령 수신을 시도합니다.
        if (xStatus == pdPASS) // 명령 큐에서 명령을 정상적으로 수신했는지 확인합니다.
        { // 명령 수신 성공 처리 블록을 시작합니다.
            if (xSemaphoreTake(xSemaphore_Actuator, pdMS_TO_TICKS(ACTUATOR_MUTEX_TIMEOUT_MS)) == pdTRUE) // 액추에이터 뮤텍스 획득을 시도하고 성공 여부를 확인합니다.
            { // 액추에이터 뮤텍스 획득 성공 블록을 시작합니다.
                prvApplyActuatorCommand(&xCmd); // 수신된 명령을 실제 PWM/GPIO 출력에 적용합니다.
                xSemaphoreGive(xSemaphore_Actuator); // 사용이 끝난 액추에이터 뮤텍스를 반환합니다.
            } // 액추에이터 뮤텍스 획득 성공 블록을 종료합니다.
            else // 액추에이터 뮤텍스 획득에 실패한 경우를 처리합니다.
            { // 액추에이터 뮤텍스 획득 실패 블록을 시작합니다.
                ulErrCount_ActuatorMutexFail++; // 뮤텍스 획득 실패로 명령이 누락된 횟수를 기록합니다.
            } // 액추에이터 뮤텍스 획득 실패 블록을 종료합니다.
        } // 명령 수신 성공 처리 블록을 종료합니다.
        // 긴급 정지는 이 태스크가 아닌 CAN 수신 태스크에서 즉시 처리됩니다. 
    } // 액추에이터 제어 태스크 무한 루프를 종료합니다.
} // 액추에이터 제어 태스크 함수를 종료합니다.

static void prvConvertCanToActuatorCmd(const CAN_Message_t *pxCanMsg, // CAN 원본 메시지 포인터를 인자로 받습니다.
                                       ActuatorCmd_t *pxCmd) // 변환된 명령을 저장할 포인터를 인자로 받습니다.
{ // CAN 메시지 변환 함수 본문을 시작합니다.
    pxCmd->commandId = CMD_NONE; // 기본 명령 ID를 명령 없음으로 초기화합니다.
    pxCmd->duty = 0U; // 기본 듀티 값을 0으로 초기화합니다.
    pxCmd->state = 0U; // 기본 GPIO 상태 값을 0으로 초기화합니다.
    pxCmd->sourceCanId = pxCanMsg->ID; // 명령 출처 CAN ID를 저장합니다.

    switch (pxCanMsg->ID) // CAN ID에 따라 명령 종류를 결정합니다.
    { // CAN ID switch 블록을 시작합니다.
        case CAN_ID_THROTTLE_CMD: // CAN ID가 스로틀 제어 명령인 경우입니다.
            if (pxCanMsg->DLC >= 2U) // 스로틀 명령에 필요한 데이터 길이가 최소 2바이트인지 확인합니다.
            { // 스로틀 데이터 처리 블록을 시작합니다.
                pxCmd->commandId = CMD_THROTTLE; // 명령 ID를 스로틀 명령으로 설정합니다.
                pxCmd->duty = (uint16_t)(((uint16_t)pxCanMsg->data[1] << 8) | // data[1]을 상위 바이트로 사용하기 위해 8비트 왼쪽 시프트합니다.
                                          (uint16_t)pxCanMsg->data[0]); // data[0]을 하위 바이트로 결합하여 16비트 듀티 값을 만듭니다.
            } // 스로틀 데이터 처리 블록을 종료합니다.
            break; // 스로틀 명령 케이스 처리를 종료합니다.

        case CAN_ID_FAN_CMD: // CAN ID가 팬 제어 명령인 경우입니다.
            if (pxCanMsg->DLC >= 1U) // 팬 명령에 필요한 데이터 길이가 최소 1바이트인지 확인합니다.
            { // 팬 데이터 처리 블록을 시작합니다.
                pxCmd->commandId = CMD_FAN; // 명령 ID를 팬 명령으로 설정합니다.
                pxCmd->state = pxCanMsg->data[0]; // data[0]을 팬 온/오프 상태로 설정합니다.
            } // 팬 데이터 처리 블록을 종료합니다.
            break; // 팬 명령 케이스 처리를 종료합니다.

        case CAN_ID_EMERGENCY: // CAN ID가 긴급 정지 명령인 경우입니다.
            // 긴급 정지는 CAN 수신 태스크에서 prvEmergencyStop()으로 즉시 처리하므로
// 일반적으로 여기 도달하지 않지만, 방어적으로 매핑을 유지합니다. 
            pxCmd->commandId = CMD_EMERGENCY_STOP; // 명령 ID를 긴급 정지로 설정합니다.
            pxCmd->duty = 0U; // 긴급 정지 시 듀티를 0으로 설정합니다.
            pxCmd->state = 0U; // 긴급 정지 시 GPIO 상태를 0으로 설정합니다.
            break; // 긴급 정지 명령 케이스 처리를 종료합니다.

        default: // 위에서 정의되지 않은 CAN ID인 경우입니다.
            break; // 제어 대상이 아니므로 아무 처리 없이 종료합니다.
    } // CAN ID switch 블록을 종료합니다.
} // CAN 메시지 변환 함수를 종료합니다.

static void prvApplyActuatorCommand(const ActuatorCmd_t *pxCmd) // 액추에이터 명령 적용 함수를 정의합니다.
{ // 액추에이터 명령 적용 함수 본문을 시작합니다.
    switch (pxCmd->commandId) // 명령 종류에 따라 실제 하드웨어 출력을 제어합니다.
    { // 명령 switch 블록을 시작합니다.
        case CMD_THROTTLE: // 스로틀 명령인 경우입니다.
            PWM_SetDuty(PWM_CHANNEL_THROTTLE, pxCmd->duty); // 스로틀 PWM 채널에 명령 듀티를 적용합니다.
            break; // 스로틀 명령 처리를 종료합니다.

        case CMD_FAN: // 팬 명령인 경우입니다.
            GPIO_Write(GPIO_PIN_FAN, pxCmd->state); // 팬 GPIO 핀에 명령 상태를 적용합니다.
            break; // 팬 명령 처리를 종료합니다.

        case CMD_EMERGENCY_STOP: // 긴급 정지 명령인 경우입니다.
            PWM_SetDuty(PWM_CHANNEL_THROTTLE, 0U); // 스로틀 PWM을 0으로 설정하여 출력을 차단합니다.
            GPIO_Write(GPIO_PIN_FAN, 0U); // 팬 GPIO를 OFF로 설정합니다.
            break; // 긴급 정지 명령 처리를 종료합니다.

        case CMD_NONE: // 명령 없음인 경우입니다.
        default: // 알 수 없는 명령인 경우입니다.
            break; // 추가 하드웨어 동작 없이 종료합니다.
    } // 명령 switch 블록을 종료합니다.
} // 액추에이터 명령 적용 함수를 종료합니다.

// --------------------------------------------------------------------------
// 긴급 정지 (수정 2)
// 큐를 거치지 않고 호출 즉시 안전 상태를 적용합니다.
// 뮤텍스는 portMAX_DELAY로 획득을 보장하므로 명령이 유실되지 않습니다.
// -------------------------------------------------------------------------- 
static void prvEmergencyStop(void) // 긴급 정지 함수를 정의합니다.
{ // 긴급 정지 함수 본문을 시작합니다.
    if (xSemaphoreTake(xSemaphore_Actuator, portMAX_DELAY) == pdTRUE) // 긴급 경로이므로 무한 대기로 액추에이터 뮤텍스 획득을 보장합니다.
    { // 액추에이터 뮤텍스 획득 성공 블록을 시작합니다.
        PWM_SetDuty(PWM_CHANNEL_THROTTLE, 0U); // 스로틀 PWM을 0으로 설정하여 출력을 차단합니다.
        GPIO_Write(GPIO_PIN_FAN, 0U); // 팬 GPIO를 OFF로 설정합니다.
        xSemaphoreGive(xSemaphore_Actuator); // 사용이 끝난 액추에이터 뮤텍스를 반환합니다.
    } // 액추에이터 뮤텍스 획득 성공 블록을 종료합니다.
    else // 뮤텍스 획득에 실패한 경우입니다. (portMAX_DELAY 사용 시 도달하지 않아야 함)
    { // 뮤텍스 획득 실패 방어 블록을 시작합니다.
        // 이론상 도달하지 않지만, 안전이 최우선이므로 뮤텍스 없이도 안전 출력을 시도합니다. 
        PWM_SetDuty(PWM_CHANNEL_THROTTLE, 0U); // 스로틀 PWM을 0으로 설정합니다.
        GPIO_Write(GPIO_PIN_FAN, 0U); // 팬 GPIO를 OFF로 설정합니다.
    } // 뮤텍스 획득 실패 방어 블록을 종료합니다.
} // 긴급 정지 함수를 종료합니다.

void vTask_Debug(void *pvParameters) // 디버깅 태스크 함수를 정의합니다.
{ // 디버깅 태스크 함수 본문을 시작합니다.
    (void)pvParameters; // 사용하지 않는 태스크 파라미터로 인한 경고를 방지합니다.
    SensorData_t xSensorData; // 디버깅 출력에 사용할 센서 데이터를 저장할 변수입니다.
    BaseType_t xStatus; // 센서 큐 수신 성공 여부를 저장할 변수입니다.
    int32_t lTempX100; // 온도를 0.01℃ 단위 정수로 저장할 변수입니다.

