ychong0711-ops/stm32-learning/01_learning_program/server/commented_build/main_build.c
            // 여기에 도달했다는 것은 스테이징 이미지 검증에 실패해 설치를
// 취소했다는 뜻입니다. 현재 펌웨어로 계속 동작하며 다음 주기에 다시
// 확인합니다. (검증 성공 시에는 위에서 리셋되어 도달하지 않습니다) 
            ulErrCount_FirmwareStageInvalid++; // 스테이징 이미지 검증 실패 횟수를 기록합니다.

            // 정지시켰던 태스크들을 되살려 정상 운전으로 복귀합니다.
// 셀프 플래싱 구조에서는 "되돌아온다"는 개념 자체가 없었지만,
// 스테이징 구조에서는 설치를 취소하고 원래 상태로 돌아올 수 있습니다. 
            if (xTaskHandle_Debug != NULL) // 디버깅 태스크 핸들이 유효한지 확인합니다.
            { // 디버깅 태스크 재개 블록을 시작합니다.
                vTaskResume(xTaskHandle_Debug); // 디버깅 태스크를 재개합니다.
            } // 디버깅 태스크 재개 블록을 종료합니다.
            if (xTaskHandle_Actuator != NULL) // 액추에이터 태스크 핸들이 유효한지 확인합니다.
            { // 액추에이터 태스크 재개 블록을 시작합니다.
                vTaskResume(xTaskHandle_Actuator); // 액추에이터 제어 태스크를 재개합니다.
            } // 액추에이터 태스크 재개 블록을 종료합니다.
            if (xTaskHandle_Sensor != NULL) // 센서 태스크 핸들이 유효한지 확인합니다.
            { // 센서 태스크 재개 블록을 시작합니다.
                vTaskResume(xTaskHandle_Sensor); // 센서 수집 태스크를 재개합니다.
            } // 센서 태스크 재개 블록을 종료합니다.
            if (xTaskHandle_CAN_Rx != NULL) // CAN 태스크 핸들이 유효한지 확인합니다.
            { // CAN 태스크 재개 블록을 시작합니다.
                vTaskResume(xTaskHandle_CAN_Rx); // CAN 수신 태스크를 재개합니다.
            } // CAN 태스크 재개 블록을 종료합니다.

            xFirmwareUpdateActive = pdFALSE; // 워치독 태스크를 정상 하트비트 감시 모드로 되돌립니다.
        } // 펌웨어 업데이트 처리 블록을 종료합니다.

        vTaskDelay(xCheckPeriod); // 다음 업데이트 요청 확인까지 5초 동안 태스크를 지연합니다.
    } // 펌웨어 업데이트 태스크 무한 루프를 종료합니다.
} // 펌웨어 업데이트 태스크 함수를 종료합니다.

int main(void) // 프로그램 진입점 main 함수를 정의합니다.
{ // main 함수 본문을 시작합니다.
    BaseType_t xCreateResult = pdFAIL; // 태스크 생성 결과를 저장할 변수입니다.

    // ---- 통합 계층: HAL 초기화 (반드시 다른 어떤 HAL 호출보다 먼저) ----
// HAL_Init() 은 (1) 플래시 프리페치/명령·데이터 캐시를 켜고, (2) NVIC 우선순위
// 그룹을 4(서브 우선순위 없음)로 설정하며, (3) SysTick 을 1ms 타임베이스로
// 시작하고 HAL_Delay()/HAL_GetTick() 이 동작하게 만듭니다.
// 이 호출이 없으면 BMP280_Init() 안의 HAL_Delay(10) 이 영원히 반환하지 않고,
// HAL 드라이버의 타임아웃 처리도 전부 무력화됩니다. 
    HAL_Init(); // HAL 라이브러리와 1ms 타임베이스(SysTick)를 초기화합니다.

    SystemClock_Config(); // 시스템 클록을 180MHz로 설정합니다.

    // SystemClock_Config() 가 HCLK 를 16MHz(HSI) → 180MHz 로 바꾸었으므로
// SysTick 재적재값을 새 클록에 맞춰 다시 계산해야 1ms 틱이 유지됩니다.
// (HAL_RCC_ClockConfig() 내부에서 HAL_InitTick() 을 다시 호출하지만,
//  SystemCoreClock 갱신과 함께 명시적으로 한 번 더 맞춰 둡니다.) 
    SystemCoreClockUpdate(); // RCC 레지스터를 읽어 SystemCoreClock 전역을 갱신합니다.
    (void)HAL_InitTick(TICK_INT_PRIORITY); // 새 클록 기준으로 HAL 타임베이스를 재설정합니다.

    // HAL_Init() 이 이미 그룹 4로 설정하지만, 의존 관계를 코드에 남기기 위해
// 명시적으로 한 번 더 호출합니다. FreeRTOS Cortex-M 포트는 "서브 우선순위 없음"
// (모든 비트가 선점 우선순위)을 전제로 configMAX_SYSCALL_INTERRUPT_PRIORITY 를
// 판정하므로 이 설정은 필수입니다.
// 주의: NVIC_PriorityGroup_4 는 구형 SPL 매크로라 HAL 에는 존재하지 않습니다.
//       HAL 의 NVIC_PRIORITYGROUP_4 를 사용해야 컴파일됩니다. (정적 증빙 결함 #2) 
    NVIC_PriorityGroupConfig(NVIC_PRIORITYGROUP_4); // STM32 NVIC 우선순위 그룹을 4로 설정합니다.

    // ---- 통합 계층: 독립 워치독 시작 ----
// 워치독 태스크의 점검 주기는 100ms 이므로, 타임아웃은 그보다 충분히 큰 1초로
// 잡습니다. IWDG 는 한 번 켜면 소프트웨어로 끌 수 없으므로 스케줄러 시작 직전에
// 시작해야 하며, 리셋 원인 플래그는 켜기 전에 읽어 두어야 의미가 있습니다. 
    ulResetCause = IWDG_GetResetFlags(); // 직전 리셋 원인(RCC->CSR 플래그)을 보존합니다.
    IWDG_ClearResetFlags(); // 다음 부팅에서 원인을 구분할 수 있도록 플래그를 지웁니다.
    IWDG_Init(1000U); // 독립 워치독을 1초 타임아웃으로 시작합니다.

    xQueue_ActuatorCmd = xQueueCreate(ACTUATOR_CMD_QUEUE_LEN, sizeof(ActuatorCmd_t)); // 액추에이터 명령 큐를 생성합니다.
    xQueue_Sensor_Data = xQueueCreate(SENSOR_DATA_QUEUE_LEN, sizeof(SensorData_t)); // 센서 데이터 큐를 생성합니다.
    xSemaphore_Actuator = xSemaphoreCreateMutex(); // 액추에이터 보호용 뮤텍스를 생성합니다.
    xMutex_Debug = xSemaphoreCreateMutex(); // 디버그 출력 보호용 뮤텍스를 생성합니다.

    configASSERT(xQueue_ActuatorCmd); // 액추에이터 명령 큐 생성 실패 시 시스템을 중단시킵니다.
    configASSERT(xQueue_Sensor_Data); // 센서 데이터 큐 생성 실패 시 시스템을 중단시킵니다.
    configASSERT(xSemaphore_Actuator); // 액추에이터 뮤텍스 생성 실패 시 시스템을 중단시킵니다.
    configASSERT(xMutex_Debug); // 디버그 뮤텍스 생성 실패 시 시스템을 중단시킵니다.

    // 태스크 생성 결과도 검사합니다.
// 주의: xTaskCreate() 호출을 configASSERT() 인자 안에 직접 넣으면,
// configASSERT가 비활성화된 빌드에서 태스크 생성 자체가 생략될 수 있습니다.
// 따라서 아래처럼 생성과 검사를 분리합니다. 
    xCreateResult = xTaskCreate(vTask_Watchdog, "Watchdog", TASK_WATCHDOG_STACK_SIZE, NULL, TASK_WATCHDOG_PRIORITY, &xTaskHandle_Watchdog); // 워치독 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 워치독 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_CAN_Rx, "CAN_Rx", TASK_CAN_STACK_SIZE, NULL, TASK_CAN_PRIORITY, &xTaskHandle_CAN_Rx); // CAN 수신 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // CAN 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_Sensor, "Sensor", TASK_SENSOR_STACK_SIZE, NULL, TASK_SENSOR_PRIORITY, &xTaskHandle_Sensor); // 센서 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 센서 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_Actuator, "Actuator", TASK_ACTUATOR_STACK_SIZE, NULL, TASK_ACTUATOR_PRIORITY, &xTaskHandle_Actuator); // 액추에이터 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 액추에이터 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_Debug, "Debug", TASK_DEBUG_STACK_SIZE, NULL, TASK_DEBUG_PRIORITY, &xTaskHandle_Debug); // 디버그 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 디버그 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_Firmware, "Firmware", TASK_FIRMWARE_STACK_SIZE, NULL, TASK_FIRMWARE_PRIORITY, &xTaskHandle_Firmware); // 펌웨어 업데이트 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 펌웨어 태스크 생성 실패 시 시스템을 중단시킵니다.

    vTaskStartScheduler(); // FreeRTOS 스케줄러를 시작합니다.
    for (;;) // 스케줄러가 종료되는 비정상 상황을 대비한 무한 루프입니다.
    { // main 무한 루프 본문을 시작합니다.
    } // main 무한 루프 본문을 종료합니다.
    return 0; // main 함수 반환값입니다. 일반적으로 도달하지 않습니다.
} // main 함수를 종료합니다.
